/**
 * Created by a on 2016/3/10.
 */

function dataTable() {
    $("#example2").DataTable({
    });
}
var str = [
    ["郑州市泰昌电子科技有限公司0","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司0","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司0","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司0","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司0","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司1","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司2","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司3","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司4","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司5","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司6","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司7","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司8","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司9","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司10","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司11","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司12","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司13","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司14","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司15","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司16","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"],
    ["郑州市泰昌电子科技有限公司17","风尚佳人,诗词天地,历史为鉴","诗词天地",17.2640,600.00,"申请提现","2015-08-04 09:18:47","2015-10-26 16:29:17"]
];
$(function () {
    for(var i=0; i<str.length; i++){
        $('#tbody').append('<tr>'
        +'<td>'+str[i][0]+'</td>'
        +'<td>'+str[i][1]+'</td>'
        +'<td>'+str[i][2]+'</td>'
        +'<td>'+str[i][3]+'</td>'
        +'<td>'+str[i][4]+'</td>'
        +'<td>'
        +'<select>'
        +'<option value="申请提现" selected>申请提现</option>'
        +'<option value="处理中">处理中</option>'
        +'<option value="拒绝">拒绝</option>'
        +'<option value="结束">结束</option>'
        +'</select>'
        +'</td>'
        +'<td>'+str[i][6]+'</td>'
        +'<td>'+str[i][7]+'</td>'
        +'</tr>');
    }
    dataTable()
});
$('#search-btn').click(function(){
    var val=$('#search-input').val();
    console.log(val);
    $('#tbody').empty();
    for(var i=0; i<str.length; i++){
        if(str[i][0]==val){
            $('#tbody').append('<tr>'
            +'<td>'+str[i][0]+'</td>'
            +'<td>'+str[i][1]+'</td>'
            +'<td>'+str[i][2]+'</td>'
            +'<td>'+str[i][3]+'</td>'
            +'<td>'+str[i][4]+'</td>'
            +'<td>'
            +'<select>'
            +'<option value="申请提现" selected>申请提现</option>'
            +'<option value="处理中">处理中</option>'
            +'<option value="拒绝">拒绝</option>'
            +'<option value="结束">结束</option>'
            +'</select>'
            +'</td>'
            +'<td>'+str[i][6]+'</td>'
            +'<td>'+str[i][7]+'</td>'
            +'</tr>');
        }
    }
    dataTable();
});










